// Домашнє завдання

// -- 1 --
// У вас є масив об’єктів fruts, і в кожному з них є name
// Напишіть код, який перетворює їх в масив імен.
// const fruts = [
//   { id: 0, name: "Apple" },
//   { id: 1, name: "Tomat" },
//   { id: 2, name: "Cherry" },
//   { id: 3, name: "Orange" },
// ];

// Відповідь №1
// console.log(fruts);
// let fruits = [];
// for (item of fruts) {
//   fruits.push(item.name);
// }
// console.log(fruits);

// -- 2 --
//Виведіть парні числа від 2 до 10, використовуючи цикл for.

// Відповідь №2
// for (let i = 2; i < 11; i++) {
//   if (i % 2 !== 0) continue;
//   console.log(i);
// }

// -- 3 --
//Замініть цикл "for" на "while"
// for (let i = 0; i < 5; i++) {
//   console.lpg(`цифра ${i}!`);
// }

// Відповідь №3
// let i = 0;
// while (i < 5) {
//   console.log(`цифра ${i}!`);
//   i++;
// }

// -- 4 --
//Напишіть цикл, який пропонує prompt ввести число більше за 100.
//Якщо відвідувач введе менше число – попросити ввести ще раз, і так далі.
//Цикл повинен запитувати число доти, доки відвідувач не введе число,
// більше за 100, або не скасує ввід/введе порожній рядок.

// Відповідь №4
// let number = parseInt(prompt("Введіть число більше 100 :"));
// while (number <= 100) {
//   alert("Ви ввели число менше 100, спробуйте ще раз:");
//   number = parseInt(prompt("Введіть число більше 100 :"));
// }
// console.log("Число", number);

// -- 5 --
// Вирахуйте середній вік
// const girls = [
//   { age: 23, name: "Оля" },
//   { age: 29, name: "Аня" },
//   { age: 10, name: "Юля" },
//   { age: 20, name: "Катя" },
// ];

// Відповідь №5
// let sum = 0;
// for (item in girls) {
//   sum += girls[item].age;
// }
// sum /= girls.length;
// console.log(`Середній вік дівчат: ${sum}`);
